# 데이터 재구성(재구조화)

## 1. 정돈된 데이터

### 1.1. Stack

In [1]:
import pandas as pd
import numpy as np

<img src='https://t1.daumcdn.net/cfile/tistory/25475A3A585FAAF42C'>

- stack[stӕk]
- ~ (sth) (up) (깔끔하게 정돈하여) 쌓다[포개다]; 쌓이다, 포개지다
- ~ sth (with sth) (어떤 곳에 물건을 쌓아서) 채우다

In [2]:
fruit = pd.read_csv('data/fruit.csv', index_col='State')
fruit

         Apple  Orange  Banana
State
Texas       12      10      40
Arizona      9       7      12
Florida      0      14     190

In [3]:
fruit.stack()

State
Texas    Apple      12
         Orange     10
         Banana     40
Arizona  Apple       9
         Orange      7
         Banana     12
Florida  Apple       0
         Orange     14
         Banana    190
dtype: int64

In [4]:
fruit_tidy = fruit.stack().reset_index()
fruit_tidy

     State level_1    0
0    Texas   Apple   12
1    Texas  Orange   10
2    Texas  Banana   40
3  Arizona   Apple    9
4  Arizona  Orange    7
5  Arizona  Banana   12
6  Florida   Apple    0
7  Florida  Orange   14
8  Florida  Banana  190

In [5]:
fruit_tidy.columns = ['state','fruit','weight'] # 컬럼 교체
fruit_tidy

     state   fruit  weight
0    Texas   Apple      12
1    Texas  Orange      10
2    Texas  Banana      40
3  Arizona   Apple       9
4  Arizona  Orange       7
5  Arizona  Banana      12
6  Florida   Apple       0
7  Florida  Orange      14
8  Florida  Banana     190

In [10]:
fruit_unstack = fruit_tidy.unstack()

In [11]:
fruit_unstack

state   0      Texas
        1      Texas
        2      Texas
        3    Arizona
        4    Arizona
        5    Arizona
        6    Florida
        7    Florida
        8    Florida
fruit   0      Apple
        1     Orange
        2     Banana
        3      Apple
        4     Orange
        5     Banana
        6      Apple
        7     Orange
        8     Banana
weight  0         12
        1         10
        2         40
        3          9
        4          7
        5         12
        6          0
        7         14
        8        190
dtype: object

### 1.2. Melt

<img src='https://t1.daumcdn.net/cfile/tistory/25177F4E5863D58A0C'/>

In [12]:
fruit = pd.read_csv('data/fruit.csv')
fruit

     State  Apple  Orange  Banana
0    Texas     12      10      40
1  Arizona      9       7      12
2  Florida      0      14     190

In [13]:
fruit.melt(id_vars=['State'], value_vars=['Apple','Orange','Banana'])

     State variable  value
0    Texas    Apple     12
1  Arizona    Apple      9
2  Florida    Apple      0
3    Texas   Orange     10
4  Arizona   Orange      7
5  Florida   Orange     14
6    Texas   Banana     40
7  Arizona   Banana     12
8  Florida   Banana    190

In [14]:
fruit.melt(id_vars=['State'], value_vars=['Apple','Orange','Banana'], var_name='Fruit', value_name='weight')

     State   Fruit  weight
0    Texas   Apple      12
1  Arizona   Apple       9
2  Florida   Apple       0
3    Texas  Orange      10
4  Arizona  Orange       7
5  Florida  Orange      14
6    Texas  Banana      40
7  Arizona  Banana      12
8  Florida  Banana     190

### 1.4.  스택된 데이터 되돌리기

In [15]:
fruit

     State  Apple  Orange  Banana
0    Texas     12      10      40
1  Arizona      9       7      12
2  Florida      0      14     190

In [16]:
fruit.stack()

0  State       Texas
   Apple          12
   Orange         10
   Banana         40
1  State     Arizona
   Apple           9
   Orange          7
   Banana         12
2  State     Florida
   Apple           0
   Orange         14
   Banana        190
dtype: object

In [17]:
fruit.stack().unstack()
# unstack() 옆으로 늘이기

     State Apple Orange Banana
0    Texas    12     10     40
1  Arizona     9      7     12
2  Florida     0     14    190

In [18]:
fruit_tidy2 = fruit.melt(id_vars=['State'], value_vars=['Apple','Orange','Banana'], var_name='Fruit', value_name='weight')
fruit_tidy2

     State   Fruit  weight
0    Texas   Apple      12
1  Arizona   Apple       9
2  Florida   Apple       0
3    Texas  Orange      10
4  Arizona  Orange       7
5  Florida  Orange      14
6    Texas  Banana      40
7  Arizona  Banana      12
8  Florida  Banana     190

In [19]:
fruit_tidy2.pivot(index='State',columns='Fruit', values='weight')

Fruit    Apple  Banana  Orange
State
Arizona      9      12       7
Florida      0     190      14
Texas       12      40      10

In [20]:
fruit.stack()

0  State       Texas
   Apple          12
   Orange         10
   Banana         40
1  State     Arizona
   Apple           9
   Orange          7
   Banana         12
2  State     Florida
   Apple           0
   Orange         14
   Banana        190
dtype: object

In [21]:
fruit.stack().unstack()

     State Apple Orange Banana
0    Texas    12     10     40
1  Arizona     9      7     12
2  Florida     0     14    190

In [22]:
fruit.stack().unstack(level=0)

            0        1        2
State   Texas  Arizona  Florida
Apple      12        9        0
Orange     10        7       14
Banana     40       12      190

In [23]:
fruit.stack().unstack(level=1)

     State Apple Orange Banana
0    Texas    12     10     40
1  Arizona     9      7     12
2  Florida     0     14    190

### 1.4. Groupby 후 unstacking

In [24]:
employee = pd.read_csv('data/employee.csv')
employee.head(3)

,UNIQUE_ID,POSITION_TITLE,DEPARTMENT,BASE_SALARY,RACE,EMPLOYMENT_TYPE,GENDER,EMPLOYMENT_STATUS,HIRE_DATE,JOB_DATE
0,0,ASSISTANT DIRECTOR (EX LVL),Municipal Courts Department,121862.0,Hispanic/Latino,Full Time,Female,Active,2006-06-12,2012-10-13
1,1,LIBRARY ASSISTANT,Library,26125.0,Hispanic/Latino,Full Time,Female,Active,2000-07-19,2010-09-18
2,2,POLICE OFFICER,Houston Police Department-HPD,45279.0,White,Full Time,Male,Active,2015-02-03,2015-02-03

In [25]:
employee.groupby('RACE')['BASE_SALARY'].mean().astype(int)

RACE
American Indian or Alaskan Native    60272
Asian/Pacific Islander               61660
Black or African American            50137
Hispanic/Latino                      52345
Others                               51278
White                                64419
Name: BASE_SALARY, dtype: int32

In [32]:
agg = employee.groupby(['RACE','GENDER'])['BASE_SALARY'].mean().astype(int)
agg

RACE                               GENDER
American Indian or Alaskan Native  Female    60238
                                   Male      60305
Asian/Pacific Islander             Female    63226
                                   Male      61033
Black or African American          Female    48915
                                   Male      51082
Hispanic/Latino                    Female    46503
                                   Male      54782
Others                             Female    63785
                                   Male      38771
White                              Female    66793
                                   Male      63940
Name: BASE_SALARY, dtype: int32

In [33]:
agg.unstack()

GENDER                             Female   Male
RACE
American Indian or Alaskan Native   60238  60305
Asian/Pacific Islander              63226  61033
Black or African American           48915  51082
Hispanic/Latino                     46503  54782
Others                              63785  38771
White                               66793  63940

In [34]:
agg2 = employee.groupby(['RACE','GENDER'])['BASE_SALARY'].agg(['mean','max','min']).astype(int)
agg2

                                           mean     max    min
RACE                              GENDER
American Indian or Alaskan Native Female  60238   98536  26125
                                  Male    60305   81239  26125
Asian/Pacific Islander            Female  63226  130416  26125
                                  Male    61033  163228  27914
Black or African American         Female  48915  150416  24960
                                  Male    51082  275000  26125
Hispanic/Latino                   Female  46503  126115  26125
                                  Male    54782  165216  26104
Others                            Female  63785   63785  63785
                                  Male    38771   38771  38771
White                             Female  66793  178331  27955
                                  Male    63940  210588  26125

In [35]:
agg2.unstack()
#agg2.unstack('GENDER')

                                    mean            max            min
GENDER                            Female   Male  Female    Male Female   Male
RACE
American Indian or Alaskan Native  60238  60305   98536   81239  26125  26125
Asian/Pacific Islander             63226  61033  130416  163228  26125  27914
Black or African American          48915  51082  150416  275000  24960  26125
Hispanic/Latino                    46503  54782  126115  165216  26125  26104
Others                             63785  38771   63785   38771  63785  38771
White                              66793  63940  178331  210588  27955  26125

### 1.5. 같은 셀에 여러 값이 저장된 경우

In [36]:
city = pd.read_csv('data/city.csv')
city

      City             Geolocation
0  Houston  29.7604° N, 95.3698° W
1   Dallas  32.7767° N, 96.7970° W
2   Austin  30.2672° N, 97.7431° W

In [41]:
g = city.Geolocation.str.split(pat='. ')
g

0    [29.7604, N, 95.3698, W]
1    [32.7767, N, 96.7970, W]
2    [30.2672, N, 97.7431, W]
Name: Geolocation, dtype: object

In [42]:
g = city.Geolocation.str.split(pat='. ', expand=True)
# 무엇을 기준으로 쪼갤까?  정규식에서 공백후 한글자(. )
g

         0  1        2  3
0  29.7604  N  95.3698  W
1  32.7767  N  96.7970  W
2  30.2672  N  97.7431  W

# 날짜를 다루는 도구

## 1. Datetime 모듈

In [43]:
import datetime

In [44]:
date = datetime.date(year=2013, month=6, day=7)
time = datetime.time(hour=12, minute=30, second=19, microsecond=463198)
dt = datetime.datetime(year=2013, month=6, day=7, hour=12, minute=30, second=19, microsecond=463198)
print(date)
print(time)
print(dt)

2013-06-07
12:30:19.463198
2013-06-07 12:30:19.463198

In [45]:
td = datetime.timedelta(weeks=2, days=5, hours=10, minutes=20, seconds=6.73)
print(td)

19 days, 10:20:06.730000

In [46]:
print(date + td)

2013-06-26

In [47]:
print(dt + td)

2013-06-26 22:50:26.193198

## 2. Timestamp

### 2.1. 유연한 입력체계

In [48]:
pd.Timestamp(year=2018, month=11, day=10, hour=9, minute=0, second=0)

Timestamp('2018-11-10 09:00:00')

In [49]:
pd.Timestamp('2018-11-10')

Timestamp('2018-11-10 00:00:00')

In [50]:
pd.Timestamp('2018/11/10')

Timestamp('2018-11-10 00:00:00')

In [51]:
pd.Timestamp('2018-11/10')

Timestamp('2018-11-10 00:00:00')

In [52]:
pd.Timestamp('Nov 10, 2018')

Timestamp('2018-11-10 00:00:00')

In [53]:
pd.Timestamp(500)

Timestamp('1970-01-01 00:00:00.000000500')

In [54]:
pd.Timestamp(1000000000000000000) # 0 20개

Timestamp('2001-09-09 01:46:40')

In [55]:
pd.Timestamp(500, unit='D')

Timestamp('1971-05-16 00:00:00')

### 2.2. to_datetime

In [56]:
pd.to_datetime('2018-11-10')

Timestamp('2018-11-10 00:00:00')

In [57]:
s = pd.Series([10, 100, 1000, 10000])
pd.to_datetime(s, unit='D')

0   1970-01-11
1   1970-04-11
2   1972-09-27
3   1997-05-19
dtype: datetime64[ns]

In [58]:
s = pd.Series(['12-5-2015','14-1-2013','20/12/2017','40/23/2017'])
pd.to_datetime(s, dayfirst=True, errors='coerce')

0   2015-05-12
1   2013-01-14
2   2017-12-20
3          NaT
dtype: datetime64[ns]

In [59]:
pd.to_datetime('Start Date: Nov 10, 2017 Start Time: 9:00 am', format='Start Date: %b %d, %Y Start Time: %I:%M %p')

Timestamp('2017-11-10 09:00:00')

In [60]:
ts = pd.Timestamp('2018-11-10 09:30:28.14')
ts

Timestamp('2018-11-10 09:30:28.140000')

In [61]:
ts.ceil('h')

Timestamp('2018-11-10 10:00:00')

In [62]:
ts.year, ts.month, ts.day, ts.hour, ts.minute, ts.second

(2018, 11, 10, 9, 30, 28)

In [63]:
ts.dayofweek, ts.dayofyear, ts.daysinmonth

(5, 314, 30)

In [64]:
ts.to_pydatetime()

datetime.datetime(2018, 11, 10, 9, 30, 28, 140000)

In [65]:
td = pd.Timedelta(123.4567, unit='h')
td

Timedelta('5 days 03:27:24.120000')

In [66]:
td.round('min')

Timedelta('5 days 03:27:00')

In [67]:
td.components

Components(days=5, hours=3, minutes=27, seconds=24, milliseconds=120, microseconds=0, nanoseconds=0)

In [68]:
td.total_seconds()

444444.12

# Magic Commander

## 1. %run : 외부 코드 실행

In [69]:
%run data/myscript.py

1 의 제곱은 1
2 의 제곱은 4
3 의 제곱은 9

- 외부 코드를 실행하면 그 안에 정의된 함수를 세션에서 사용 가능

In [70]:
square(5)

25

## 2. 코드 실행 시간 측정

- %timeit : 단일 코드 시간 측정

In [73]:
%timeit L = [n ** 2 for n in range(1000)]

355 µs ± 4.4 µs per loop (mean ± std. dev. of 7 runs, 1000 loops each)

- %%timeit를 사용하면 여러 코드 실행 시간 측정 가능

In [74]:
%%timeit
L = []
for n in range(1000):
    L.append(n**2)

399 µs ± 7.21 µs per loop (mean ± std. dev. of 7 runs, 1000 loops each)

## 3. 매직 커맨더 도움말 : ?, %magic, %lsmagic

- ? : 명령어 뒤에 ? 붙이면 도움말
- %magic : 매직 커맨더에 대한 일반적인 설명과 예제
- %lsmagic : 매직 커맨더 리스트

In [75]:
%xmode?

## 4. %history : 이전에 실행된 명령

In [79]:
%history -n 1-4

   1:
import pandas as pd
import numpy as np
   2:
fruit = pd.read_csv('data/fruit.csv', index_col='State')
fruit
   3: fruit.stack()
   4:
fruit_tidy = fruit.stack().reset_index()
fruit_tidy

## 5. automagic 함수 : %없이도 사용가능

- %cd : 폴더 이동
- %ls : 폴더 내에 모든 파일 리스트
- %mkdir : 폴더 생성
- %mv : 이동
- %cp : 복사
- %pwd : 현재 작업 폴더
- %rm : 삭제
- %rmdir : 폴더 삭제

In [80]:
pwd

'C:\\Users\\user\\Desktop\\BigDataCourse\\Week4\\Mon'

In [81]:
ls

 C 드라이브의 볼륨에는 이름이 없습니다.
 볼륨 일련 번호: 1E13-A1BF

 C:\Users\user\Desktop\BigDataCourse\Week4\Mon 디렉터리

2020-04-20  오전 11:39    <DIR>          .
2020-04-20  오전 11:39    <DIR>          ..
2020-04-20  오전 11:05    <DIR>          .ipynb_checkpoints
2020-04-09  오후 04:03           129,740 1 Pandas 기초.ipynb
2020-04-09  오전 10:28            56,941 2 데이터 시각화.ipynb
2020-04-09  오전 10:12           143,701 200408_class02.ipynb
2020-04-13  오후 01:44            63,616 3 단일선형회귀분석 .ipynb
2020-04-14  오후 06:43            24,450 Aggregation_practice_김병목.ipynb
2020-04-13  오후 12:36        47,241,969 Allstate_train.csv
2020-04-20  오전 09:45    <DIR>          cache
2020-03-30  오후 06:32             9,516 Chapter1_0330.ipynb
2020-04-09  오후 06:37           458,823 chapter10_시각화1.ipynb
2020-04-10  오후 04:42           204,909 chapter11_MachineLearning2.ipynb
2020-04-14  오후 06:42         1,228,748 chapter12_dataProcessing4(merge)_Week 2 Fri_ file 2.ipynb
2020-04-14  오전 11:54           167,353 chapter13_MachineLearning3(Ensemble).ipynb
2020-04-20  오전 11:39            77,302 chapter14_dataProcessing5(rearrange).ipynb
2020-04-07  오후 04:35           165,963 chapter7_dataProcessing2.ipynb
2020-04-13  오후 06:28            32,758 chapter8_MachineLearning1.ipynb
2020-04-10  오전 10:32            46,589 chapter9_dataProcessiing3(agg).ipynb
2020-04-20  오전 09:45    <DIR>          data
2020-04-07  오후 04:44         4,826,904 DATA_01.csv
2020-04-05  오전 02:30             7,228 data_pepNewCustomers.csv
2020-04-05  오전 02:30            22,646 data_pepTestCustomers.csv
2020-04-07  오후 04:35            33,303 DATA_SETS.ipynb
2020-04-07  오후 06:37         2,408,870 data1111.xlsx
2020-04-14  오후 06:43           425,848 H_project_001.ipynb
2020-04-14  오후 06:43           405,312 H_project_004.ipynb
2020-04-20  오전 10:17           476,512 H_project_005.ipynb
2020-04-20  오전 09:45    <DIR>          hotel_data
2020-04-14  오후 03:44           129,383 Hyundai 백화점.ipynb
2020-04-08  오후 05:02           261,791 Machine Learning - Week 2 Wednesday file 1.ipynb
2020-04-14  오후 06:42           441,732 Machine Learning - Week 2 Wednesday file 1_2.ipynb
2020-04-20  오전 11:03            36,046 Machine Learning book - notes.ipynb
2020-04-10  오후 04:39           806,867 Machine Learning Week 2 Friday 과재_김병목.html
2020-04-14  오후 06:36           507,866 Machine Learning Week 2 Friday 과재_김병목.ipynb
2020-04-06  오후 10:38            16,989 Machine Learning 기본 개념 - Basic concept.ipynb
2020-04-13  오전 10:29           597,611 ML_Ensemble.pdf
2020-04-09  오전 11:01         3,114,960 output_data_01.csv
2020-04-10  오후 03:27             4,144 pep_target.csv
2020-04-13  오후 02:54           328,863 test.csv
2020-04-13  오후 02:12           394,715 train.csv
2020-04-10  오전 10:36               615 Untitled.ipynb
2020-04-13  오후 06:28            66,767 Week2 Thursday file 1.ipynb
2020-04-07  오후 06:55           158,774 Week2 Tuesday file 1.ipynb
2020-04-07  오후 06:55           408,234 Week2 Tuesday file 2.ipynb
2020-04-06  오후 07:04            83,203 과제- Week 2_Monday.ipynb
2020-04-07  오후 03:41            55,187 금수저.xlsx
2020-04-07  오후 03:29            80,235 나이와직업.xlsx
2020-04-09  오전 11:05            39,812 데이터전처리 과제풀이 (1).ipynb
2020-04-08  오전 10:14            96,734 시험 Week 2 Tuesday.ipynb
              44개 파일          66,289,529 바이트
               6개 디렉터리  117,586,952,192 바이트 남음

- 추가적으로 알고싶으면
<a href='https://ipython.readthedocs.io/en/stable/interactive/magics.html'>Magic Commander(클릭)</a>